# Limpieza a realizar

- **Visit Date** -> Cambiar a tipo fecha -> ((Ok))
- **Conversion** -> Cambiar a str?? -> ((Ok))
- **Product Category** -> Cambiar a minus. Cambiar fashhion a fashion.
- **Product Id** -> Cambiar a num??
- **Product Name** -> Cambiar espacios por '_'.
- **Price** -> Tiene 40 nulos (2%). Cambiar ',' por '.' decimal formato americano y cambiar tipo float.
- **Discount** -> Tiene 40 nulos (2%). Cambiar ',' por '.' decimal formato americano y cambiar tipo float.
- **Total Value** -> Cambiar ',' por '.' decimal formato americano y cambiar tipo float.
- **Payment Method** -> Al parecer tiene 1753 nulos (87.65%). 
- **Shipping Method** -> Al parecer tiene 1753 nulos (87.65%).
- **Customer Age** -> Tiene 40 nulos.
- **Device** -> Cambiar a minusc.
- **Coupon Used** -> Al parecer tiene 1753 nulos (87.65%).
- **Browser** -> Cambiar categorías, están mal escritas.
- **Referral Source** -> Cambiar a minusc.

In [51]:
#Trataiento de datos
import pandas as pd
pd.set_option('display.max_columns',None)  # Lim columnas
#-------------------

In [ ]:
df_raw = pd.read_csv ('../data/data_raw.csv') #DF original df_raw
df_raw.sample(5)

,User Id,Group,Visit Date,Conversion,Product Category,Product Id,Product Name,Quantity,Price,Discount,Total Value,Payment Method,Shipping Method,Region,Customer Age,Customer Gender,Device,Session Duration,Coupon Used,Browser,Referral Source
696,697,A,2022-03-05,0,BEAUTY,P1971,Perfume,0,"52,68","0,14","0,0",NaN,NaN,East,23.0,F,TABLET,8,NaN,Eddddge,Organic
722,723,A,2022-03-02,0,FASHHION,P1507,Sneakers,0,"155,54","0,16","0,0",NaN,NaN,South,66.0,F,TABLET,29,NaN,Firefoxxxxxx,PAID
1196,1197,B,2022-03-19,0,FASHHION,P1698,Sneakers,0,"164,29","0,21","0,0",NaN,NaN,North,70.0,M,TABLET,28,NaN,Eddddge,PAID
893,894,A,2022-02-20,0,HOME,P1121,Table,0,"464,81","0,13","0,0",NaN,NaN,North,33.0,F,Desktop,12,NaN,Safaaaaari,PAID
942,943,B,2022-03-16,0,BOOKS,P1605,Science Fiction,0,"46,02","0,2","0,0",NaN,NaN,East,56.0,M,TABLET,16,NaN,Eddddge,Organic

---
## Limpieza

### 1- Copia de DF para no miodificar el original

In [53]:
df = df_raw.copy()

### 2- Cambio columnas, minúscula y sin espacios

In [54]:
df.columns = df.columns.str.replace(' ','_').str.lower()

In [55]:
df.columns

Index(['user_id', 'group', 'visit_date', 'conversion', 'product_category',
       'product_id', 'product_name', 'quantity', 'price', 'discount',
       'total_value', 'payment_method', 'shipping_method', 'region',
       'customer_age', 'customer_gender', 'device', 'session_duration',
       'coupon_used', 'browser', 'referral_source'],
      dtype='object')

### 3- Cambio visit_date a fecha

In [57]:
#pd.to_datetime(df['visit_date'], format='%Y-%m-%d') piso la columna original
df['visit_date'] = pd.to_datetime(df['visit_date'], format='%Y-%m-%d')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 21 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   user_id           2000 non-null   int64
 1   group             2000 non-null   object
 2   visit_date        2000 non-null   datetime64[ns]
 3   conversion        2000 non-null   int64
 4   product_category  2000 non-null   object
 5   product_id        2000 non-null   object
 6   product_name      2000 non-null   object
 7   quantity          2000 non-null   int64
 8   price             1960 non-null   object
 9   discount          1960 non-null   object
 10  total_value       2000 non-null   object
 11  payment_method    247 non-null    object
 12  shipping_method   247 non-null    object
 13  region            2000 non-null   object
 14  customer_age      1960 non-null   float64
 15  customer_gender   2000 non-null   object
 16  device            2000 non-null   object
 17  session_duration  2000 non-null   int64
 18  coupon_used       247 non-null    object
 19  browser           2000 non-null   object
 20  referral_source   2000 non-null   object
dtypes: datetime64[ns](1), float64(1), int64(4), object(15)
memory usage: 328.3+ KB

### 4- Conversión a STR

In [ ]:
df['conversion_str'] = df['conversion'].apply(lambda x: 'yes' if x==1 else 'no') #Nueva columna STR

In [59]:
df.sample(5)

,user_id,group,visit_date,conversion,product_category,product_id,product_name,quantity,price,discount,total_value,payment_method,shipping_method,region,customer_age,customer_gender,device,session_duration,coupon_used,browser,referral_source,conversion_str
1576,1577,A,2022-02-11,0,TOYS,P1427,Puzzle,0,"79,15","0,21","0,0",NaN,NaN,East,52.0,F,Mobile,14,NaN,Firefoxxxxxx,Email,no
804,805,A,2022-03-28,0,BEAUTY,P1790,Lipstick,0,"11,5","0,1","0,0",NaN,NaN,South,34.0,M,Mobile,14,NaN,Ottttther,Organic,no
571,572,B,2022-01-20,0,HOME,P1067,Sofa,0,"288,55","0,28","0,0",NaN,NaN,Central,48.0,M,Mobile,8,NaN,Ottttther,Email,no
62,63,B,2022-01-24,1,BOOKS,P1900,Science Fiction,2,"36,63","0,24","55,68",Bank Transfer,Express,West,27.0,F,Mobile,10,Yes,Ottttther,Social,yes
942,943,B,2022-03-16,0,BOOKS,P1605,Science Fiction,0,"46,02","0,2","0,0",NaN,NaN,East,56.0,M,TABLET,16,NaN,Eddddge,Organic,no

In [ ]:
df.loc[:, ['conversion','conversion_str']] #Compruebo

      conversion conversion_str
0              0             no
1              0             no
2              0             no
3              1            yes
4              0             no
...          ...            ...
1995           0             no
1996           0             no
1997           0             no
1998           0             no
1999           0             no

[2000 rows x 2 columns]

### 5- Product Category, cambiar a minus y Cambiar fashhion a fashion.

minuto 23